package tomcatSrc;

/**
 *   Cookie的定义:
 *      Cookie实际上是一小段的文本信息。
 *      
 *     原因:   
 *      HTTP协议是无状态的协议,服务器无法从连接上跟踪会话.
 *      客户端请求服务器,如果服务器需要记录该用户状态,就使用response向客户端浏览器颁发
 *      一个Cookie。客户端浏览器会把Cookie保存起来。当浏览器再请求该网站时，浏览器把请求
 *      的网址连同该Cookie一同提交给服务器。服务器检查该Cookie，以此来辨认用户状态。
 *     
 *     注意:
 *      Cookie功能需要浏览器的支持。如果浏览器不支持Cookie（如大部分手机中的浏览器）或者把
 *      Cookie禁用了，Cookie功能就会失效。
 *
 *---------------------------------------------------------------------------
 *
 *
 *  Cookie的数据结构:
 *  
 *  
 *
 *
 *
 */

public class Cookie{

}
